[
  {
    "title": "Systems Analytics Co-op",
    "startDate": "May 2022",
    "endDate": "Current",
    "details": [
      "Designed and implemented architectural rework of MATLAB data classes of medical device’s procedural data.",
      "Worked on characterization of 2 5DoF sensors as a 6DoF tool.",
      "Coordinated hardware integration in new software use cases of an optical tracking application."],
    "icon": "fas fa-heartbeat",
    "website": "https://kardium.com/",
    "image": ""
  },
  {
    "title": "Full Stack Developer (Co-op)",
    "startDate": "May 2021",
    "endDate": "Aug 2021",
    "details": [
      "Implemented features, tests, and debugged the SaaS application, AQUARIUS Samples.",
      "Developed shell scripts to automate the collection of the cloud application’s performance data.",
      "Collaborated in an Agile team environment to strategize and meet sprint commitments."],
    "icon": "fas fa-tint",
    "website": "https://aquaticinformatics.com/",
    "image": ""
  },
  {
    "title": "Systems Software Engineering Co-op",
    "startDate": "Sept 2020",
    "endDate": "Apr 2021",
    "details": [
      "Took ownership of a binocular tracking project, developing an algorithm that detects an object and computes it's translational and rotational motion.",
      "Worked extensively with Open CV to perform stereo calibration on camera setup and detect features of interest from a video stream.",
    "Additionally, assisted in data extraction from experimental procedures and expansion of MATLAB data extraction tools used in house."],
    "icon": "fas fa-heartbeat",
    "website": "https://kardium.com/",
    "image": ""
  },
  {
    "title": "Research Assistant (Biophysics Lab)",
    "startDate": "Sept 2018",
    "endDate": "May 2019",
    "details": [
      "Worked with Steve Plotkin on the Honours Thesis: Construction of a Ctenophore Husbandry System for Experimentation and Genetic Network Modeling.",
      "Participated in pioneering work on establishing the first ctenophore husbandry system for the purpose of evolutionary biology research; started with basic knowledge and limited access to Mnemiopsis leidyi.",
    "Setup and maintained protocols of the ctenophore culturing system and documented through troubleshooting and fine tuning of the culturing system to determine viable conditions for the M. leidyi to survive."],
    "icon": "fas fa-flask",
    "website": "https://www.phas.ubc.ca/~steve/research/index_Research.html",
    "image": "images/experiences/ctenoim.png"
  },
  {
    "title": "Biophotonics Research Assistant",
    "startDate": "Jan",
    "endDate": "Aug 2018",
    "details": [
      "Set up proof of concept experiments for novel laser-based multi-live-cell labeling method. Worked with fluorescent and brightfield microscopy, microscopy aided laser irradiation and culturing human cells.",
      "Developed MatLab code for brightfield and fluorescent cell image segmentation and cell fluorescence analysis, pre and post irradiation"],
    "icon": "fas fa-flask",
    "website": "http://www.biophotonics.ca/labo/",
    "image": "images/experiences/N010WGA555-2t0.jpg"
  },
  {
    "title": "CHEBE Research Internship",
    "startDate": "Jan",
    "endDate": "Aug 2018",
    "details": [
      "Worked directly with a Post-Doctoral Fellow in the laboratory investigating the bioremediation of industrial wastes using microbial consortia.",
      "Prepared bacterial enrichment cultures samples for various analysis including, flow cytometry, mineralogy and DNA sequencing.",
    "Produced python script to analyze raw flow cytometry data to eliminate dependency on FlowJo, a flow cytometry data analysis software."],
    "icon": "fas fa-flask",
    "website": "https://www.chbe.ubc.ca/profile/susan-baldwin/",
    "image": "images/experiences/chebe.png"
  }
 ]